---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredRotation
source: html/8dfa47d1-1a67-b15d-b0e3-842f1d0d8a17.htm
---
# Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredRotation Property

The property labeled "Rotation" from the "AdvancedLayered" schema.

## Syntax (C#)
```csharp
public static string LayeredRotation { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.